
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов

#define BUZZER_PIN 12  // пин подключения 



//способности:
//издать звук  
void zvuk(){
   // зуммер издает звук 0,5с
    digitalWrite(BUZZER_PIN, HIGH);
    delay(500);
    // зуммер «молчит» 2с
    digitalWrite(BUZZER_PIN, LOW);
    delay(2000);
}
//записать на картоу данные 
void zapisat(){
  
}
//считывание данных  MFRC522
void schitvanie(){

}
//вывести число на экран
void vivod_na_ekran(){
  
}


void setup() {       //-слэш - разрез /слэш в гору \слэш с горы
  int s=0;

}

void loop() {
 //переход Триггеры 

 //------------------
 //состояния

 //------------------
}
